Revit 2026 API
Surface Class
 A mathematical representation of a surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 More
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public class Surface : IDisposable
Public Class Surface
	Implements IDisposable
public ref class Surface : IDisposable
type Surface =
    class
        interface IDisposable
    end
The Surface type exposes the following members.
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
OrientationMatchesParametricOrientation |  Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
Top
Methods
Name | Description
Dispose | Releases all resources used by the Surface
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundingBoxUV |  Gets the UV bounding box of the surface.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
Project |  Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
ProjectWithGuessPoint |  Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This geometric object is not bounded by edges or edge loops. A bounded surface obtained from a Revit element will be represented by a Face instead.
See Also
Reference
Autodesk.Revit.DB Namespace
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.ConicalSurface
 Autodesk.Revit.DB.CylindricalSurface
 Autodesk.Revit.DB.HermiteSurface
 Autodesk.Revit.DB.OffsetSurface
 Autodesk.Revit.DB.Plane
 Autodesk.Revit.DB.RevolvedSurface
 Autodesk.Revit.DB.RuledSurface